// Задача 40: Напишите программу, которая принимает на вход три
// числа и проверяет, может ли существовать треугольник с сторонами
// такой длины.
// Теорема о неравенстве треугольника: каждая сторона треугольника
// меньше суммы двух других сторон.

Console.Write("Введите первое число: ");
int number1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите второе число: ");
int number2 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите третье число: ");
int number3 = Convert.ToInt32(Console.ReadLine());

bool CheckTriangle(int num1, int num2, int num3)
{
    return num1 < num2 + num3 && num2 < num1 + num3 && num3 < num2 + num1;
}

bool checkTriangle = CheckTriangle(number1, number2, number3);

Console.WriteLine($"Существует ли треугольник  - {(checkTriangle ? "Да" : "Нет")}");

// if (CanTriangleExite(sideA, sideB, sideC)) Console.WriteLine($"Да, существует");
//  else Console.WriteLine($"Нет, не существует");